Table of Contents
 Class RebarStirrups
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a rebar grouping in 3D space.
[OpenModelClass("CI.StructModel.Structure.RebarStirrups,CI.StructuralElements", "CI.StructModel.Structure.IRebarStirrups,CI.BasicTypes")]
public class RebarStirrups : RebarBase
Inheritance
object
OpenObject
OpenElementId
RebarBase
RebarStirrups
Inherited Members
 RebarBase.Material
 RebarBase.Diameter
 RebarBase.RebarShape
 RebarBase.RebarParentElement
 RebarBase.RebarAllocationElement
 RebarBase.GroupId
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 RebarStirrups()
create a new instance.
public RebarStirrups()
Properties
 Patterns
Gets or sets the pattern of the rebar grouping. Holds distance between rebars/stirrups and length
public List<RebarStirrupPattern> Patterns { get; set; }
Property Value
List<RebarStirrupPattern>
 Edit this page